React_Module_Scripts/React_Employee_Module_apis/absenceAPI_smoke.yml
execution:
#- executor: jmeter
- concurrency: 50
  ramp-up: 50s
  hold-for: 50m
  scenario: Employee_Module_get

scenarios:
  Employee_Module_get:
    script: Employee_Module_get.jmx

modules:
  console:
    disable: true # disable runtime console reporter

reporting:
#- module: console
- module: passfail
  criteria:
  - avg-rt>10s for 30s, stop as failed
  - fail>50% for 20s, stop as failed